In [2]:
import pandas as pd

df = pd.read_csv('csv_data/a1.csv')
df

     姓名   國文  英文  數學   社會   地理
0   陳信宏   65  60  66   81  100
1   游治旺   72  88  52   86   75
2   翁羽威   88  91  96   76   97
3   洪阿惠   91  50  93   61   83
4   翁均安   87  79  95   63   62
5   蘇婷婷   86  73  57   94   84
6   吳淑惠   51  54  55   72   65
7   鄧哲榮   54  90  58   90   88
8   李淑芳   61  78  56   77   66
9   童建霖   89  61  75   61   97
10  錢佩豪   67  90  74   57   60
11  馮芳如   98  71  94   80   50
12  陳孝邦   64  76  99   70   98
13  唐翊修  100  88  56   83   78
14   戚亨   70  70  94   72   62
15  程玫靖   59  62  71   62   68
16  楊建安   53  99  79   86   82
17  錢佩豪   63  57  71   60   91
18  林佳慧   99  73  73   55   90
19  鄭琇亞   86  76  76  100   73
20  謝水儒   54  73  66   68   85
21  黃婷婷   59  96  72   50   56
22  游治旺   96  60  93  100   50
23  周琬婷   93  94  86   58   57
24  王展人   67  82  66   56   85
25  周琬婷   62  95  76   94   97
26  黃彥孝   90  73  89   95   54
27  馮芳如   81  55  66   74   61
28  李慶亮   61  87  57   73  100
29  龐皓芳   97  91  61   90   77

In [3]:
s1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
s1.reindex(['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [5]:
s1.reindex(['a','b','c'])

a   -5.3
b    7.2
c    3.6
dtype: float64

In [6]:
s2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
s2

0      blue
2    purple
4    yellow
dtype: object

In [8]:
s2.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
import numpy as np
df = pd.DataFrame(np.arange(9).reshape(3,3),
             index = ['a','c','d'],
             columns = ['台北', '台中', '高雄'])

df

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [10]:
df.reindex(['a','b','c','d'])

    台北   台中   高雄
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  3.0  4.0  5.0
d  6.0  7.0  8.0

In [11]:
df.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [12]:
df.reindex(columns=['台北','高雄'])

   台北  高雄
a   0   2
c   3   5
d   6   8

In [13]:
df[['台北','高雄']]

   台北  高雄
a   0   2
c   3   5
d   6   8

In [14]:
df.reindex(columns=['台北','高雄'],index=['a','d'])

   台北  高雄
a   0   2
d   6   8

In [15]:
s3 = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
s3

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [16]:
s3.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
s3.drop(['a','e'])

b    1.0
c    2.0
d    3.0
dtype: float64

In [18]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [19]:
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [20]:
data.drop(['one','two'],axis='columns')

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [21]:

data.drop('台北',inplace=True)

In [22]:
data

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15